* 全局函数
谓词 =fboundp= 用于判断是否有个函数的名字与给定的符号绑定。
#+BEGIN_SRC lisp
  (fboundp '+)
#+END_SRC

#+RESULTS:
: T

如果一个符号是函数的名字，则 =symbol-function= 会返回它。
#+BEGIN_SRC lisp
  (symbol-function '+)
#+END_SRC

#+RESULTS:
: #<FUNCTION +>

可以通过 =symbol-function= 给函数配置某个名字。
#+BEGIN_SRC lisp
  (setf (symbol-function 'add2)
        #'(lambda (x) (+ x 2)))
#+END_SRC


通过把 =defun= 的第一个实参变成形式的列表 =(setf f)= ，可以如下。第一个实参代表新的数值，剩下的实参代表了传给 =f= 的参数。
#+BEGIN_SRC lisp
  (defun primo (lst) (car lst))

  (defun (setf primo) (val lst)
    (setf (car lst) val))

  ;; 调用第二个函数，会改变列表x的值。
  (let ((x (list 'a 'b 'c)))
    (setf (primo x) 480)
    x)
#+END_SRC

由于字符串是Lisp表达式，可以出现在代码的主体。字符串本身是没有副作用的，除非它是最后一个表达式，否则不会造成任何差别。如果让字符串成为 =defun= 定义的函数主体的第一个表达式，那么该字符串可以作为函数的文档字符串。

函数 =documentation= 可以获取函数的文档字符串。
#+BEGIN_SRC lisp
  (defun foo (x)
    "Implements an enhanced paradigm of diversity"
    x)

  (documentation 'foo 'function)
#+END_SRC
* 局部函数
通过 =defun= 或 =symbol-function= 搭配 =setf= 定义的函数是全局函数。

局部函数可以使用 =labels= 来定义，第一个实参是一个新局部函数的定义列表，形式如下
#+BEGIN_SRC lisp
  (name parameters . body)
#+END_SRC

=labels= 表达式的剩余部分，调用 =name= 相当于调用 =(lambda parameters . body)= 。
#+BEGIN_SRC lisp
  (labels ((add10 (x) (+ x 10))
           (consa (x) (cons 'a x)))
    (consa (add10 3)))
#+END_SRC

#+RESULTS:
: (A . 13)


=labels= 表达式所定义的局部函数，可以被其他任何在此定义的函数引用，包括自己。
#+BEGIN_SRC lisp
  (labesl ((len (lst)
                (if (null lst)
                    0
                    (+ (len (cdr lst)) 1))))
          (len '(a b c)))
#+END_SRC

=do= 表达式同样可以被解释成调用递归函数。
#+BEGIN_SRC lisp
  (do ((x a (b x))
       (y c (d y)))
      ((test x y) (z x y))
    (f x y))

  ;;等同于

  (labels (rec (x y)
               (cond ((test x y)
                      (z x y))
                     (t
                      (f x y)
                      (rec (b x) (d y))))))
#+END_SRC
* 动态作用域
词法作用域的词法变量作用于局部变量。

动态作用域的特别变量作用于特别变量。

在词法作用域下，一个符号引用到上下文中符号名字出现的地方。
#+BEGIN_SRC lisp
  (let ((x 10))
    (defun foo ()
      x))
  (let ((x 20)) (foo))
#+END_SRC

动态作用域，我们在环境中函数被调用的地方寻找变量。要使一个变量是动态作用域的，我们需要在任何它出现的上下文中声明它是 =special= 。
#+BEGIN_SRC lisp
  (let ((x 10))
    (defun foo ()
      (declare (special x))
      x))
#+END_SRC
函数内的 =x= 就不会再引用到函数定义里的按个词法变量，但会引用到函数被调用时，当下所存在的任何特别变量 =x= 。
#+BEGIN_SRC lisp
  (let ((x 20))
    (declare (special x))
    (foo))
#+END_SRC
#+RESULTS:
: 20

新的变量被创建出来之后，一个 =declare= 调用可以在代码的任何地方出现。
=special= 声明是独一无二的，因为它可以改变程序的行为。


通过在顶层调用 =setf= 来设置全局变量，是隐式地将变量声明为特殊变量。
#+BEGIN_SRC lisp
  (setf x 30)
  (foo)
#+END_SRC

#+RESULTS:
: 30


在一个文件里的代码，如果不想依赖隐式的特殊声明，可以使用 =defparameter= 取代。

动态作用域的用途：用来暂时给某个全局变量赋新值。

=*print-base*= ，缺省值是10，可以改变为16显示十六进制数字输出。重新绑定 =*print-base*= 。
#+BEGIN_SRC lisp
  (let ((*print-base* 16))
    (printc 32))
#+END_SRC

